app/controllers/airplanes_controller.rb

SELECT "airplanes".* FROM "airplanes" ORDER BY "airplanes"."created_at" DESC
---
  def index
    @airplanes = Airplane.order(:created_at => 'desc')

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_airplane
      @airplane = Airplane.find(params[:id])