app/controllers/flights_controller.rb

  def index
    @flights = Flight.order(:created_at => 'desc')
---
SELECT "flights".* FROM "flights" ORDER BY "flights"."created_at" DESC