app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations" ORDER BY "reservations"."created_at" DESC
---
  def index
    @reservations = Reservation.order(:created_at => 'desc')