app/controllers/users_controller.rb

  def index
    @users = User.order(:created_at => 'desc')
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC